[Timeout] BlockStatement
src/main/components/OurTable.js:55:26
         ))}
       </thead>
       <tbody {...getTableBodyProps()}>
-        {rows.map(row => {
-          prepareRow(row)
-          return (
-            <tr {...row.getRowProps()}>
-              {row.cells.map((cell, _index) => {
-                const cellStyle = { textAlign: 'right' };
-                return (
-                  <td
-                    {...cell.getCellProps({
-                      style: cellStyle,
-                    })}
-                    data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                  >
-                    {cell.render('Cell')}
-                  </td>
-                )
-              })}
-            </tr>
-          )
-        })}
+        {rows.map(row => {})}
       </tbody>
     </Table>

[Timeout] BlockStatement
src/main/components/OurTable.js:59:48
           prepareRow(row)
           return (
             <tr {...row.getRowProps()}>
-              {row.cells.map((cell, _index) => {
-                const cellStyle = { textAlign: 'right' };
-                return (
-                  <td
-                    {...cell.getCellProps({
-                      style: cellStyle,
-                    })}
-                    data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                  >
-                    {cell.render('Cell')}
-                  </td>
-                )
-              })}
+              {row.cells.map((cell, _index) => {})}
             </tr>
           )
