[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:7:21
 export default function ReportHeaderTable({ report  }) {
     const columns = [
         {
-            Header: 'Cow Price',
+            Header: "",
             accessor: 'cowPrice', 
             Cell: ({ value }) => `$${value}`
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Cow Price. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.js:9:19
         {
             Header: 'Cow Price',
             accessor: 'cowPrice', 
-            Cell: ({ value }) => `$${value}`
+            Cell: () => undefined
         },
         {
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:13:23
         },
         {
             Header: 'Milk Price',
-            accessor: 'milkPrice',
+            accessor: "",
             Cell: ({ value }) => `$${value}`
         },
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-milkPrice"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.js:14:19
         {
             Header: 'Milk Price',
             accessor: 'milkPrice',
-            Cell: ({ value }) => `$${value}`
+            Cell: () => undefined
         },
         {
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:16:9
             accessor: 'milkPrice',
             Cell: ({ value }) => `$${value}`
         },
-        {
-            Header: 'Start Bal',
-            accessor: 'startingBalance',
-            Cell: ({ value }) => `$${value}`
-        },
+        {},
         {
             Header: 'Start Date',
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Reports/ReportHeaderTable.js:19:19
         {
             Header: 'Start Bal',
             accessor: 'startingBalance',
-            Cell: ({ value }) => `$${value}`
+            Cell: () => undefined
         },
         {
killedBy: AdminViewReportPage tests renders correctly for admin user
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:28:21
 
         },
         {
-            Header: 'Leaderboard',
+            Header: "",
             id: 'showLeaderboard',
             accessor: (row, _rowIndex) => String(row.showLeaderboard) // hack needed for boolean values to show up
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Leaderboard. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:36:9
             Header: 'Capacity',
             accessor: 'carryingCapacity',
         },
-        {
-            Header: 'Degrad Rate',
-            accessor: 'degradationRate',
-        },
+        {},
         {
             Header: 'BelowCap',
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Reports/ReportHeaderTable.js:44:9
             Header: 'BelowCap',
             accessor: 'belowCapacityHealthUpdateStrategy',
         },
-        {
-            Header: 'AboveCap',
-            accessor: 'aboveCapacityHealthUpdateStrategy',
-        },
+        {},
     ];
 
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reports/ReportHeaderTable.js:50:20
         },
     ];
 
-    const testid = "ReportHeaderTable";
+    const testid = "";
 
     return <OurTable
killedBy: ReportHeaderTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportHeaderTable-cell-row-0-col-cowPrice"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
