[Killed] ArrowFunction
main/components/Reports/ReportLineTable.js:17:19
         {
             Header: 'Total Wealth',
             accessor: 'totalWealth',
-            Cell: ({ value }) => `$${value}`
+            Cell: () => undefined
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:17:34
         {
             Header: 'Total Wealth',
             accessor: 'totalWealth',
-            Cell: ({ value }) => `$${value}`
+            Cell: ({ value }) => ``
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  $9745
Received:

[Killed] StringLiteral
main/components/Reports/ReportLineTable.js:21:23
         },
         {
             Header: 'Num Cows',
-            accessor: 'numOfCows', 
+            accessor: "", 
         },
         {
killedBy: ReportLineTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReportLineTable-cell-row-0-col-numOfCows"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"
