[Killed] EqualityOperator
main/components/Commons/CommonsList.js:34:37
                 </Container>
             </Card.Subtitle>
             {
-                props.commonList && props.commonList.length > 0 ?
+                props.commonList && props.commonList.length <= 0 ?
                 props.commonList.map((c) => (
                     <CommonsCard key={c.id} commons={c} buttonText={props.buttonText} buttonLink={props.buttonLink} />
killedBy: CommonsList tests renders without crashing when button text is set
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="/commonsCard-button/"]

<body>
  <div>
    <div
      class="my-3 border-0 card"
      style="opacity: 0.9;"
    >

[Killed] EqualityOperator
main/components/Commons/CommonsList.js:34:37
                 </Container>
             </Card.Subtitle>
             {
-                props.commonList && props.commonList.length > 0 ?
+                props.commonList && props.commonList.length >= 0 ?
                 props.commonList.map((c) => (
                     <CommonsCard key={c.id} commons={c} buttonText={props.buttonText} buttonLink={props.buttonLink} />
killedBy: CommonsList tests displays default message when there are no commons
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Currently, there are no commons available./i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="my-3 border-0 card"
      style="opacity: 0.9;"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsList.js:35:38
             </Card.Subtitle>
             {
                 props.commonList && props.commonList.length > 0 ?
-                props.commonList.map((c) => (
-                    <CommonsCard key={c.id} commons={c} buttonText={props.buttonText} buttonLink={props.buttonLink} />
-                )) :
+                props.commonList.map(() => undefined) :
                 <div className="text-center my-3">Currently, there are no commons available.</div>
             }
killedBy: HomePage tests Redirects to the PlayPage when you click visit
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Visit-1"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(HomePageBackground-day.png);"
    >
