[Killed] ObjectLiteral
main/components/Leaderboard/LeaderboardTable.js:21:9
             Header: 'Username',
             accessor: 'username', 
         },
-        {
-            Header: 'Total Wealth',
-            id: 'totalWealth',
-            accessor: (row, _rowIndex) => {
-                return USD.format(row.totalWealth);
-            },
-            // sortType: 
-            //     (rowA,rowB,_id,_desc)=>{
-            //         // const diff = parseFloat() - parseFloat(rowB.original.totalWealth);
-            //         return rowA.original.totalWealth - rowB.original.totalWealth;
-            //     }
-            // ,
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
-        },
+        {},
         {
             Header: 'Cows Owned',
killedBy: LeaderboardTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Leaderboard/LeaderboardTable.js:33:30
             //         return rowA.original.totalWealth - rowB.original.totalWealth;
             //     }
             // ,
-            Cell: (props) => {
-                return (
-                  <div style={{textAlign: "right"}}>{props.value}</div>)
-            },
+            Cell: (props) => {},
         },
         {
killedBy: LeaderboardTable tests Has the expected column headers and content for adminUser
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
