[Killed] StringLiteral
main/components/Commons/CommonsForm.js:35:21
 
     const {data: values} = useBackend(
         "/api/commons/defaults", {
-            method: "GET",
+            method: "",
             url: "/api/commons/defaults",
         },
killedBy: CommonsForm tests the correct parameters are passed to useBackend
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/commons/defaults", {"method": "GET", "url": "/api/commons/defaults"}
Received
       1
          "/api/commons/all-health-update-strategies",
          Object {
            "method": "GET",

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:43:13
     
     useEffect(() => {
         //if no default values or must use initial commons, immediately return and do not use defaults
-        if (!values || initialCommons) {
+        if (true) {
             return;
         }
killedBy: CommonsForm tests use default values when initial commons not provided
statusReason: Error: expect(element).toHaveValue(500)

Expected the element to have value:
  500
Received:
  0

[Killed] BlockStatement
main/components/Commons/CommonsForm.js:43:40
     
     useEffect(() => {
         //if no default values or must use initial commons, immediately return and do not use defaults
-        if (!values || initialCommons) {
-            return;
-        }
+        if (!values || initialCommons) {}
         //replace and reset the default values given by the defaults endpoint
         const {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot destructure property 'startingBalance' of 'values' as it is undefined.

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:74:25
 
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const DefaultVals = {
-        name: "",
-        startingDate: today,
-    };
+    const DefaultVals = {};
 
     return (
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-11-28)

Expected the element to have value:
  2023-11-28
Received:

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:133:47
                                 data-testid={`${testid}-startingBalance`}
                                 type="number"
                                 step="0.01"
-                                defaultValue={values?.startingBalance}
+                                defaultValue={values.startingBalance}
                                 isInvalid={!!errors.startingBalance}
                                 {...register("startingBalance", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'startingBalance')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:134:45
                                 type="number"
                                 step="0.01"
                                 defaultValue={values?.startingBalance}
-                                isInvalid={!!errors.startingBalance}
+                                isInvalid={!errors.startingBalance}
                                 {...register("startingBalance", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:163:47
                                 id="cowPrice"
                                 type="number"
                                 step="0.01"
-                                defaultValue={values?.cowPrice}
+                                defaultValue={values.cowPrice}
                                 isInvalid={!!errors.cowPrice}
                                 {...register("cowPrice", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'cowPrice')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:164:44
                                 type="number"
                                 step="0.01"
                                 defaultValue={values?.cowPrice}
-                                isInvalid={!!errors.cowPrice}
+                                isInvalid={!errors.cowPrice}
                                 {...register("cowPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:193:47
                                 id="milkPrice"
                                 type="number"
                                 step="0.01"
-                                defaultValue={values?.milkPrice}
+                                defaultValue={values.milkPrice}
                                 isInvalid={!!errors.milkPrice}
                                 {...register("milkPrice", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'milkPrice')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:194:44
                                 type="number"
                                 step="0.01"
                                 defaultValue={values?.milkPrice}
-                                isInvalid={!!errors.milkPrice}
+                                isInvalid={!errors.milkPrice}
                                 {...register("milkPrice", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:225:47
                                 id="degradationRate"
                                 type="number"
                                 step="0.0001"
-                                defaultValue={values?.degradationRate}
+                                defaultValue={values.degradationRate}
 
                                 isInvalid={!!errors.degradationRate}
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'degradationRate')

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:231:42
                                 {...register("degradationRate", {
                                     valueAsNumber: true,
                                     required: "Degradation rate is required",
-                                    min: {value: 0, message: "Degradation rate must be ≥ 0"},
+                                    min: {},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Degradation rate must be ≥ 0/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:253:47
                                 id="carryingCapacity"
                                 type="number"
                                 step="1"
-                                defaultValue={values?.carryingCapacity}
+                                defaultValue={values.carryingCapacity}
                                 isInvalid={!!errors.carryingCapacity}
                                 {...register("carryingCapacity", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'carryingCapacity')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:254:45
                                 type="number"
                                 step="1"
                                 defaultValue={values?.carryingCapacity}
-                                isInvalid={!!errors.carryingCapacity}
+                                isInvalid={!errors.carryingCapacity}
                                 {...register("carryingCapacity", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:255:66
                                 step="1"
                                 defaultValue={values?.carryingCapacity}
                                 isInvalid={!!errors.carryingCapacity}
-                                {...register("carryingCapacity", {
-                                    valueAsNumber: true,
-                                    required: "Carrying capacity is required",
-                                    min: {value: 1, message: "Carrying Capacity must be ≥ 1"},
-                                })}
+                                {...register("carryingCapacity", {})}
                             />
                         </OverlayTrigger>
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Carrying capacity is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:258:62
                                 {...register("carryingCapacity", {
                                     valueAsNumber: true,
                                     required: "Carrying capacity is required",
-                                    min: {value: 1, message: "Carrying Capacity must be ≥ 1"},
+                                    min: {value: 1, message: ""},
                                 })}
                             />
killedBy: CommonsForm tests has validation errors for values out of range
statusReason: Error: Unable to find an element with the text: /Carrying Capacity must be ≥ 1/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:280:47
                                 id="capacityPerUser"
                                 type="number"
                                 step="1"
-                                defaultValue={values?.capacityPerUser}
+                                defaultValue={values.capacityPerUser}
                                 isInvalid={!!errors.capacityPerUser}
                                 {...register("capacityPerUser", {
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'capacityPerUser')

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:281:44
                                 type="number"
                                 step="1"
                                 defaultValue={values?.capacityPerUser}
-                                isInvalid={!!errors.capacityPerUser}
+                                isInvalid={!errors.capacityPerUser}
                                 {...register("capacityPerUser", {
                                     valueAsNumber: true,
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:296:74
             </Row>
 
 
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+            <Form.Group className="mb-5" style={{width: '300px', height: ""}} data-testid={`${testid}-r3`}>
                 <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- height: 50px;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:296:96
             </Row>
 
 
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={``}>
                 <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r3"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:309:38
                         type="date"
                         defaultValue={DefaultVals.startingDate}
                         isInvalid={!!errors.startingDate}
-                        {...register("startingDate", {
+                        {...register("", {
                             valueAsDate: true,
                             validate: {isPresent: (v) => !isNaN(v)},
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:330:39
                     <HealthUpdateStrategiesDropdown
                         formName={"aboveCapacityHealthUpdateStrategy"}
                         displayName={"When above capacity"}
-                        initialValue={values?.aboveCapacityHealthUpdateStrategy}
+                        initialValue={values.aboveCapacityHealthUpdateStrategy}
                         register={register}
                         healthUpdateStrategies={healthUpdateStrategies}
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'aboveCapacityHealthUpdateStrategy')

[Killed] OptionalChaining
main/components/Commons/CommonsForm.js:340:39
                     <HealthUpdateStrategiesDropdown
                         formName={"belowCapacityHealthUpdateStrategy"}
                         displayName={"When below capacity"}
-                        initialValue={values?.belowCapacityHealthUpdateStrategy}
+                        initialValue={values.belowCapacityHealthUpdateStrategy}
                         register={register}
                         healthUpdateStrategies={healthUpdateStrategies}
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'belowCapacityHealthUpdateStrategy')
