[Killed] StringLiteral
main/components/Commons/CommonsForm.js:32:9
     );
 
     const {data: values} = useBackend(
-        "/api/commons/defaults", {
+        "", {
             method: "GET",
             url: "/api/commons/defaults",
killedBy: CommonsForm tests the correct parameters are passed to useBackend
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/commons/defaults", {"method": "GET", "url": "/api/commons/defaults"}
Received
       1
          "/api/commons/all-health-update-strategies",
          Object {
            "method": "GET",

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:41:13
     
     useEffect(() => {
         //if no default values or must use initial commons, immediately return and do not use defaults
-        if (!values || initialCommons) {
+        if (false) {
             return;
         }
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot destructure property 'startingBalance' of 'values' as it is undefined.

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:41:13
     
     useEffect(() => {
         //if no default values or must use initial commons, immediately return and do not use defaults
-        if (!values || initialCommons) {
+        if (!values && initialCommons) {
             return;
         }
killedBy: CommonsForm tests renders correctly
statusReason: TypeError: Cannot destructure property 'startingBalance' of 'values' as it is undefined.

[Killed] ArrayDeclaration
main/components/Commons/CommonsForm.js:66:8
             aboveCapacityHealthUpdateStrategy,
             belowCapacityHealthUpdateStrategy,
         });
-    }, [values, initialCommons, reset]);
+    }, []);
 
     const testid = "CommonsForm";
killedBy: CommonsForm tests use default values when initial commons not provided
statusReason: Error: expect(element).toHaveValue(500)

Expected the element to have value:
  500
Received:
  0

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:72:60
 
     const curr = new Date();
     const today = curr.toISOString().split('T')[0];
-    const onemonthfromtoday = new Date(curr.getFullYear(), curr.getMonth()+1, curr.getDate()).toISOString().split('T')[0];
+    const onemonthfromtoday = new Date(curr.getFullYear(), curr.getMonth() - 1, curr.getDate()).toISOString().split('T')[0];
 
     const DefaultVals = {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-12-30)

Expected the element to have value:
  2023-12-30
Received:
  2023-10-30

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:74:25
     const today = curr.toISOString().split('T')[0];
     const onemonthfromtoday = new Date(curr.getFullYear(), curr.getMonth()+1, curr.getDate()).toISOString().split('T')[0];
 
-    const DefaultVals = {
-        name: "",
-        startingDate: today,
-        lastDate: onemonthfromtoday
-    };
+    const DefaultVals = {};
 
     return (
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-11-30)

Expected the element to have value:
  2023-11-30
Received:

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:296:98
                 </Col>
             </Row>
 
-            <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r4`}>
+            <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={``}>
             <Col md={4}>
             <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r4"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:296:77
                 </Col>
             </Row>
 
-            <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r4`}>
+            <Row className="mt-1 flex justify-content-start" style={{width: ""}} data-testid={`${testid}-r4`}>
             <Col md={4}>
             <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 80%;

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:298:96
 
             <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r4`}>
             <Col md={4}>
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r3`}>
+            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={``}>
                 <Form.Label htmlFor="startingDate">Starting Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r3"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Commons/CommonsForm.js:324:49
             </Col>
             
             <Col md={4}>
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r5`}>
+            <Form.Group className="mb-5" style={{}} data-testid={`${testid}-r5`}>
                 <Form.Label htmlFor="lastDate">Last Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- width: 300px;
