[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:78:53
     
     //last date is 70 days after today
     // No need to test this line, as it is just a default value
-    const quarterLater = new Date(curr.getTime() + (70 * 24 * 60 * 60 * 1000));
+    const quarterLater = new Date(curr.getTime() + (70 * 24 * 60 * 60 / 1000));
     const quarterLaterString = convertToDateTimeLocalString(quarterLater);
     
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-02-09T01:54)

Expected the element to have value:
  2024-02-09T01:54
Received:
  2023-12-01T01:54

[Killed] ArithmeticOperator
main/components/Commons/CommonsForm.js:78:35
     
     //last date is 70 days after today
     // No need to test this line, as it is just a default value
-    const quarterLater = new Date(curr.getTime() + (70 * 24 * 60 * 60 * 1000));
+    const quarterLater = new Date(curr.getTime() - 70 * 24 * 60 * 60 * 1000);
     const quarterLaterString = convertToDateTimeLocalString(quarterLater);
     
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-02-09T01:54)

Expected the element to have value:
  2024-02-09T01:54
Received:
  2023-09-22T02:54

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:82:15
     const quarterLaterString = convertToDateTimeLocalString(quarterLater);
     
     const DefaultVals = {
-        name: "",
+        name: "Stryker was here!",
         startingDate: today,
         lastDate: quarterLaterString
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: Unable to find an element with the text: Commons name is required. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:219:98
             </Row>
 
 
-            <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={`${testid}-r2`}>
+            <Row className="mt-1 flex justify-content-start" style={{width: '80%'}} data-testid={``}>
                 <Col md={4}>
                     <Form.Group className="mb-3">
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r2"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:320:58
                         isInvalid={!!errors.startingDate}
                         {...register("startingDate", {
                             valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v)}
+                            validate: {isPresent: (v) => isNaN(v)}
                         })}
                     />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] ArrowFunction
main/components/Commons/CommonsForm.js:320:51
                         isInvalid={!!errors.startingDate}
                         {...register("startingDate", {
                             valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v)}
+                            validate: {isPresent: () => undefined}
                         })}
                     />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control

[Killed] StringLiteral
main/components/Commons/CommonsForm.js:331:96
             </Col>
             
             <Col md={4}>
-            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={`${testid}-r5`}>
+            <Form.Group className="mb-5" style={{width: '300px', height: '50px'}} data-testid={``}>
                 <Form.Label htmlFor="lastDate">Last Date</Form.Label>
                 <OverlayTrigger
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsForm-r5"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Commons/CommonsForm.js:346:65
                         isInvalid={!!errors.lastDate}
                         {...register("lastDate", {
                             valueAsDate: true,
-                            validate: {checkGreaterDate: (v) => checkGreaterDate(v, getValues().startingDate) || "Last date must be ≥ starting date"}
+                            validate: {checkGreaterDate: (v) => checkGreaterDate(v, getValues().startingDate) && "Last date must be ≥ starting date"}
                         })}
                     />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last date must be ≥ starting date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:346:65
                         isInvalid={!!errors.lastDate}
                         {...register("lastDate", {
                             valueAsDate: true,
-                            validate: {checkGreaterDate: (v) => checkGreaterDate(v, getValues().startingDate) || "Last date must be ≥ starting date"}
+                            validate: {checkGreaterDate: (v) => true}
                         })}
                     />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last date must be ≥ starting date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
