[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:54:23
         },
         {
             Header: <small>Cow<br />Price</small>,
-            accessor: row => row.commons.cowPrice,
+            accessor: () => undefined,
             id: 'commons.cowPrice'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:57:9
             accessor: row => row.commons.cowPrice,
             id: 'commons.cowPrice'
         },
-        {
-            Header: <small>Milk<br />Price</small>,
-            accessor: row => row.commons.milkPrice,
-            id: 'commons.milkPrice'
-        },
+        {},
         {
             Header: <small>Starting<br />Balance</small>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:59:23
         },
         {
             Header: <small>Milk<br />Price</small>,
-            accessor: row => row.commons.milkPrice,
+            accessor: () => undefined,
             id: 'commons.milkPrice'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:64:23
         },
         {
             Header: <small>Starting<br />Balance</small>,
-            accessor: row => row.commons.startingBalance,
+            accessor: () => undefined,
             id: 'commons.startingBalance'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  10
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:79:23
         },
         {
             Header: <small>Degrad.<br />Rate</small>,
-            accessor: row => row.commons.degradationRate,
+            accessor: () => undefined,
             id: 'commons.degradationRate'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0.01
Received:

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:87:9
             id: 'commons.showLeaderboard', // needed for tests
             accessor: (row, _rowIndex) => String(row.commons.showLeaderboard) // hack needed for boolean values to show up
         },
-        {
-            Header: 'Cows',
-            accessor: 'totalCows'
-        },
+        {},
         {
             Header: <small>Cap.<br />Per User</small>,
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:93:23
         },
         {
             Header: <small>Cap.<br />Per User</small>,
-            accessor: row => row.commons.capacityPerUser,
+            accessor: () => undefined,
             id: 'commons.capacityPerUser'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  5
Received:

[Killed] ArrowFunction
main/components/Commons/CommonsTable.js:98:23
         },
         {
             Header: <small>Carrying<br />Cap.</small>,
-            accessor: row => row.commons.carryingCapacity,
+            accessor: () => undefined,
             id: 'commons.carryingCapacity'
         },
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:99:17
         {
             Header: <small>Carrying<br />Cap.</small>,
             accessor: row => row.commons.carryingCapacity,
-            id: 'commons.carryingCapacity'
+            id: ""
         },
         {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:101:9
             accessor: row => row.commons.carryingCapacity,
             id: 'commons.carryingCapacity'
         },
-        {
-            Header: <small>Effective<br />Cap.</small>,
-            accessor: 'effectiveCapacity'
-        }
+        {}
     ];
 
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:103:23
         },
         {
             Header: <small>Effective<br />Cap.</small>,
-            accessor: 'effectiveCapacity'
+            accessor: ""
         }
     ];
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:107:20
         }
     ];
 
-    const testid = "CommonsTable";
+    const testid = "";
 
     const columnsIfAdmin = [
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] ArrayDeclaration
main/components/Commons/CommonsTable.js:109:28
 
     const testid = "CommonsTable";
 
-    const columnsIfAdmin = [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, testid),
-        ButtonColumn("Delete", "danger", deleteCallback, testid),
-        ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-        HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
-    ];
+    const columnsIfAdmin = [];
 
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element with the text: /id/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: block; max-

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:111:30
 
     const columnsIfAdmin = [
         ...columns,
-        ButtonColumn("Edit", "primary", editCallback, testid),
+        ButtonColumn("Edit", "", editCallback, testid),
         ButtonColumn("Delete", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
killedBy: UserTable tests Has the expected column headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:114:26
         ButtonColumn("Edit", "primary", editCallback, testid),
         ButtonColumn("Delete", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-        HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
+        HrefButtonColumn("", "success", `/api/commonstats/download?commonsId=`, testid),
     ];
 
killedBy: UserTable tests renders without crashing for empty table for admin
statusReason: Error: A column ID (or string accessor) is required!
