[Killed] BlockStatement
src/main/utils/commonsUtils.js:18:58
     }
 }
 
-export function commonsNotJoined(commons, commonsJoined) {
-    const joinedIdList = commonsJoined.map(c => c.id);
-    return commons.filter(f => !joinedIdList.includes(f.id));
-}
+export function commonsNotJoined(commons, commonsJoined) {}
 
 export function convertToDateTimeLocalString(date) {
killedBy: CommonsUtils commonsNotJoined it computes the correct result
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: undefined

[Killed] ArrowFunction
src/main/utils/commonsUtils.js:19:44
 }
 
 export function commonsNotJoined(commons, commonsJoined) {
-    const joinedIdList = commonsJoined.map(c => c.id);
+    const joinedIdList = commonsJoined.map(() => undefined);
     return commons.filter(f => !joinedIdList.includes(f.id));
 }
killedBy: CommonsUtils commonsNotJoined it computes the correct result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  0
+ Received  + 42

@@ -1,17 +1,45 @@
  Array [
    Object {

[Killed] BooleanLiteral
src/main/utils/commonsUtils.js:20:32
 
 export function commonsNotJoined(commons, commonsJoined) {
     const joinedIdList = commonsJoined.map(c => c.id);
-    return commons.filter(f => !joinedIdList.includes(f.id));
+    return commons.filter(f => joinedIdList.includes(f.id));
 }
 
killedBy: HomePage tests Calls the callback when you click join
statusReason: Error: Unable to find an element by: [data-testid="commonsCard-button-Join-4"]

<body>
  <div>
    <div
      data-testid="HomePage-main-div"
      style="background-size: cover; background-image: url(HomePageBackground-night.png);"
    >

[Killed] ArrowFunction
src/main/utils/commonsUtils.js:20:27
 
 export function commonsNotJoined(commons, commonsJoined) {
     const joinedIdList = commonsJoined.map(c => c.id);
-    return commons.filter(f => !joinedIdList.includes(f.id));
+    return commons.filter(() => undefined);
 }
 
killedBy: CommonsUtils commonsNotJoined it computes the correct result
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 58
+ Received  +  1

- Array [
-   Object {
-     "aboveCapacityHealthUpdateStrategy": "Linear",

[Killed] BlockStatement
src/main/utils/commonsUtils.js:23:52
     return commons.filter(f => !joinedIdList.includes(f.id));
 }
 
-export function convertToDateTimeLocalString(date) {
-    const year = date.getFullYear();
-    const month = (date.getMonth() + 1).toString().padStart(2, "0");
-    const day = date.getDate().toString().padStart(2, "0");
-    const hours = date.getHours().toString().padStart(2, "0");
-    const minutes = date.getMinutes().toString();
-  
-    return `${year}-${month}-${day}T${hours}:${minutes}`;
-  }
+export function convertToDateTimeLocalString(date) {}
 
 export function checkGreaterDate(date1, date2) {
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(expected)

Expected the element to have value:
  (any)
Received:

[Killed] ArithmeticOperator
src/main/utils/commonsUtils.js:25:20
 
 export function convertToDateTimeLocalString(date) {
     const year = date.getFullYear();
-    const month = (date.getMonth() + 1).toString().padStart(2, "0");
+    const month = (date.getMonth() - 1).toString().padStart(2, "0");
     const day = date.getDate().toString().padStart(2, "0");
     const hours = date.getHours().toString().padStart(2, "0");
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-00-09T01:59)

Expected the element to have value:
  2024-00-09T01:59
Received:

[Killed] StringLiteral
src/main/utils/commonsUtils.js:25:64
 
 export function convertToDateTimeLocalString(date) {
     const year = date.getFullYear();
-    const month = (date.getMonth() + 1).toString().padStart(2, "0");
+    const month = (date.getMonth() + 1).toString().padStart(2, "");
     const day = date.getDate().toString().padStart(2, "0");
     const hours = date.getHours().toString().padStart(2, "0");
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2024-2-09T01:59)

Expected the element to have value:
  2024-2-09T01:59
Received:

[Killed] StringLiteral
src/main/utils/commonsUtils.js:27:58
     const year = date.getFullYear();
     const month = (date.getMonth() + 1).toString().padStart(2, "0");
     const day = date.getDate().toString().padStart(2, "0");
-    const hours = date.getHours().toString().padStart(2, "0");
+    const hours = date.getHours().toString().padStart(2, "");
     const minutes = date.getMinutes().toString();
   
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/utils/commonsUtils.js:33:48
     return `${year}-${month}-${day}T${hours}:${minutes}`;
   }
 
-export function checkGreaterDate(date1, date2) {
-    const d1 = new Date(date1);
-    const d2 = new Date(date2);
-    return d1 > d2;
-}
+export function checkGreaterDate(date1, date2) {}
killedBy: CommonsForm tests Check Default Values and correct styles
statusReason: Error: expect(element).toHaveValue(2023-12-01T02:0)

Expected the element to have value:
  2023-12-01T02:0
Received:

[Killed] ConditionalExpression
src/main/utils/commonsUtils.js:36:12
 export function checkGreaterDate(date1, date2) {
     const d1 = new Date(date1);
     const d2 = new Date(date2);
-    return d1 > d2;
+    return true;
 }
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last date must be ≥ starting date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
src/main/utils/commonsUtils.js:36:12
 export function checkGreaterDate(date1, date2) {
     const d1 = new Date(date1);
     const d2 = new Date(date2);
-    return d1 > d2;
+    return d1 >= d2;
 }
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
