[Killed] ConditionalExpression
main/components/Commons/CommonsForm.js:320:58
                         isInvalid={!!errors.startingDate}
                         {...register("startingDate", {
                             valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v) || "Starting date is required"}
+                            validate: {isPresent: (v) => false}
                         })}
                     />
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BooleanLiteral
main/components/Commons/CommonsForm.js:320:58
                         isInvalid={!!errors.startingDate}
                         {...register("startingDate", {
                             valueAsDate: true,
-                            validate: {isPresent: (v) => !isNaN(v) || "Starting date is required"}
+                            validate: {isPresent: (v) => isNaN(v) || "Starting date is required"}
                         })}
                     />
killedBy: CommonsForm tests has validation errors for required fields
statusReason: Error: expect(element).toHaveClass("is-invalid")

Expected the element to have class:
  is-invalid
Received:
  form-control
