[Killed] BlockStatement
src/main/utils/commonsUtils.js:33:48
     return `${year}-${month}-${day}T${hours}:${minutes}`;
   }
 
-export function checkGreaterDate(date1, date2) {
-    const d1 = new Date(date1);
-    const d2 = new Date(date2);
-    return d1 >= d2;
-}
+export function checkGreaterDate(date1, date2) {}
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/utils/commonsUtils.js:36:12
 export function checkGreaterDate(date1, date2) {
     const d1 = new Date(date1);
     const d2 = new Date(date2);
-    return d1 >= d2;
+    return true;
 }
killedBy: CommonsForm tests has validation errors for required fields
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last date must be ≥ starting date. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
src/main/utils/commonsUtils.js:36:12
 export function checkGreaterDate(date1, date2) {
     const d1 = new Date(date1);
     const d2 = new Date(date2);
-    return d1 >= d2;
+    return d1 < d2;
 }
killedBy: AdminCreateCommonsPage tests When you fill in form and click submit, the right things happens
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
